<?php

namespace App\View\Components;

use Illuminate\View\Component;

class Playlist extends Component
{
    /**
     * Create a new component instance.
     *
     * @return void
     */
    public function __construct()
    {
        //
    }

    /**
     * Get the view / contents that represent the component.
     *
     * @return \Illuminate\Contracts\View\View|\Closure|string
     */
    public function render()
    {
        $videos = [
            ['filename' => 'Үй және дала құстары', 'title' => 'Үй және дала құстары'],
            ['filename' => 'Халықаралық өнер байқауы', 'title' => 'Халықаралық өнер байқауы'],
            ['filename' => 'Сандар қатары туралы білімін бекіту', 'title' => 'Сандар қатары туралы білімін бекіту'],
            ['filename' => 'Дене шынықтыру', 'title' => 'Дене шынықтыру'],
            ['filename' => 'Балаладрың мінез-құлқын қалыптастырудағы музыканың ролі', 'title' => 'Балаладрың мінез-құлқын қалыптастырудағы музыканың ролі'],
            ['filename' => '2023-09-15 14-54-21', 'title' => 'Балбопе тобы'],
            ['filename' => 'VIDEO-2023-09-19-11-53-34', 'title' => 'Доппен ойнау'],
            ['filename' => 'VIDEO-2023-09-19-12-08-22', 'title' => 'Ересек бүлдіршін тобы - Шаттық шеңбер'],
            ['filename' => 'VIDEO-2023-09-19-12-13-28', 'title' => 'Қазақшаң қалай, балакай?'],
            ['filename' => 'VIDEO-2023-09-20-12-41-47', 'title' => 'Ересек Балбөбек тобы - таңғы жаттығу'],
            ['filename' => 'VIDEO-2023-09-27-08-18-34', 'title' => 'Балбөбек тобы - сурет салу'],
            ['filename' => 'VIDEO-2023-09-27-08-18-33', 'title' => 'Балбөбек тобы - математика негіздері'],
            ['filename' => 'VIDEO-2023-10-03-08-31-36', 'title' => '1 Қазан - Халықаралық қарттар күні'],
	        ['filename' => 'VIDEO-2023-10-03-08-31-37', 'title' => 'Балбөбек тобы - Ұйқы ашар жаттығулар'],
	        ['filename' => 'VIDEO-2023-10-03-08-31-37 (1)', 'title' => 'Ересек Байтерек тобы'],
            ['filename' => 'VIDEO-2023-10-05-09-36-36', 'title' => 'Хабар телеарнасының таңғы жүргізушісі'],
            ['filename' => 'Ролик_2_рус', 'title' => 'Обращение в государственный орган'],
            ['filename' => 'Ролик_2_каз', 'title' => 'Мемлекеттік органға өтініш'],
            ['filename' => 'VIDEO-2023-10-12-10-39-57', 'title' => 'Балбобек тобы'],
            ['filename' => 'VIDEO-2023-10-16-14-43-38', 'title' => 'Вокал үйірмесінің жұмысы'],
            ['filename' => 'VIDEO-2023-10-17-08-23-38', 'title' => 'Арнайы мамандардың ерекше білімді қажет ететін балалармен жұмыс жасау әдістері'],
            ['filename' => 'VIDEO-2023-10-19-13-21-38', 'title' => 'Ересек Бүлдіршін тобы - Республика күні'],
            ['filename' => 'VIDEO-2023-10-19-13-26-35', 'title' => 'Балбобек ересек тобы - Республика күні'],
            ['filename' => 'VIDEO-2023-11-06-09-30-17', 'title' => '"Қош келдің,алтын күз" ертеңгілігі'],
            ['filename' => 'VIDEO-2023-11-06-09-31-59', 'title' => '"Бүлдіршін" Ересек тобы'],
            ['filename' => 'WhatsApp Video 2023-11-10 at 13.17.51', 'title' => 'Интерактивті скалодром”  балабақшаның спорт залында орнатылған. Балалардың физикалық дағдыларын жетілдіруге мүмкіндік береді. Ептілік,қимыл қозғалысты үйлестіре отырып,логиканы,есте сақтауды,ойлауды,қиялды дамытады'],
            ['filename' => 'WhatsApp Video 2023-11-10 at 13.14.05', 'title' => '“Құм терапиясы” интерактивті құм терапиясын қолдана отырып,құммен ойын -сауық ойындары кез келген әрекетті танымдық және қызықты етуге мүмкіндік береді. Интерактивті құм терапиясы жеке кабинетте  орнатылған,балалардың зияткерлік,интеллектуалдық ,шығармашылық дағдыларын ашуға бағытталған.'],
            ['filename' => 'WhatsApp Video 2023-11-10 at 13.08.59', 'title' => 'Тілашар'],
            ['filename' => 'WhatsApp Video 2023-11-10 at 13.08.15', 'title' => '“Ақылды айна” интерактивті құрылғы арқылы баланың психоэмоционалды жағдайын түзету үшінжасалған прогрессивті жабдық. Интерактивті әсері бар инновациялық модель ойын процессінде сөйлеу бұзылыстарын жоюға мүмкіндік береді. Интерактивті құрылғымен логопед,дефектолог,психолог мамандары жұмыс жүргізеді.'],
            ['filename' => 'WhatsApp Video 2023-11-13 at 09.15.22', 'title' => 'Тамақтандыру ұйымдастыру бойынша бракераждық комиссия жұмысы жүргізілді'],
            ['filename' => 'WhatsApp Video 2023-11-13 at 09.39.59', 'title' => '08.11.2023 балабақшамызға тәжірибе адмасу мақсатында қаламыздың балабақшаладың меңгерушілері келіп, бір күндік өмірімен танысты'],
            ['filename' => 'WhatsApp Video 2023-11-15 at 13.27.33', 'title' => 'Балалармен түзету-дамыту жұмыстары'],
            ['filename' => 'WhatsApp Video 2023-11-22 at 11.38.31', 'title' => '«Тәуелсіздік – ел тұғыры!» патриоттық челлендж'],
            ['filename' => 'WhatsApp Video 2023-11-23 at 10.00.03', 'title' => '“Астана сақа” челенджі'],
        ];

        return view('components.playlist', ['videos' => array_reverse($videos)]);
    }
}
